20260308202531-raygadnagar_tekdi_6_dec_2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-11 Wed 03:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Raygadnagar Tekdi – 6 Dec 2025</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Raygadnagar Tekdi – 6 Dec 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga37e6d1">Trek Overview</a></li>
<li><a href="#orgff3b9be">Schedule &amp; Companions</a></li>
<li><a href="#org3566d90">Route Information</a></li>
<li><a href="#orgdc9f900">Historical / Mythological Background</a></li>
<li><a href="#org916edd9">Key Landmarks &amp; Attractions</a></li>
<li><a href="#orgd72fa8c">Experience &amp; Observations</a></li>
<li><a href="#orga6d5fc7">Facilities &amp; Amenities</a></li>
<li><a href="#org2ce341b">Local Notes</a></li>
<li><a href="#orge7d323c">Photos &amp; Media</a></li>
<li><a href="#org4caa921">Reflection</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga37e6d1" class="outline-2">
<h2 id="orga37e6d1">Trek Overview</h2>
<div class="outline-text-2" id="text-orga37e6d1">
<ol class="org-ol">
<li>Trek Name:</li>
<li>Region:</li>
<li>Range:</li>
<li>Base Village:</li>
<li>Height from MSL (ft):</li>
<li>Type:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> hill fort</li>
<li class="off"><code>[&#xa0;]</code> forest trail</li>
<li class="off"><code>[&#xa0;]</code> plateau</li>
</ul></li>
<li>Difficulty Level:</li>
<li class="off"><code>[&#xa0;]</code> easy</li>
<li class="off"><code>[&#xa0;]</code> moderate</li>
<li class="off"><code>[&#xa0;]</code> difficult</li>
<li>Best Season:</li>
<li class="off"><code>[&#xa0;]</code> winter</li>
<li class="off"><code>[&#xa0;]</code> summer</li>
<li class="off"><code>[&#xa0;]</code> monsoon</li>
<li>Time taken to Climb [hrs]:</li>
<li>Water Availability:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
<li>Suitable For:</li>
<li class="off"><code>[&#xa0;]</code> beginners</li>
<li class="off"><code>[&#xa0;]</code> regular trekkers</li>
<li class="off"><code>[&#xa0;]</code> families</li>
</ol>
</div>
</div>

<div id="outline-container-orgff3b9be" class="outline-2">
<h2 id="orgff3b9be">Schedule &amp; Companions</h2>
<div class="outline-text-2" id="text-orgff3b9be">
<ol class="org-ol">
<li>Date:</li>
<li>Team Members:</li>
<li>Wake-up Time:</li>
<li>Left Home:</li>
<li>Start Point / Meeting Place:</li>
<li>Route Start Time:</li>
<li>Return Time:</li>
<li>Key Stops / Temples / Checkpoints:
<ul class="org-ul">
<li></li>

<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org3566d90" class="outline-2">
<h2 id="org3566d90">Route Information</h2>
<div class="outline-text-2" id="text-org3566d90">
<ol class="org-ol">
<li>Route from Base City:</li>
<li>Final Village Distance km:</li>
<li>Public Transport Availability:</li>
<li>Parking / Auto / Petrol:</li>
</ol>
</div>
</div>

<div id="outline-container-orgdc9f900" class="outline-2">
<h2 id="orgdc9f900">Historical / Mythological Background</h2>
<div class="outline-text-2" id="text-orgdc9f900">
<ol class="org-ol">
<li>Historical Importance:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Legends / Myths:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Nearby Heritage / Religious Sites:
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org916edd9" class="outline-2">
<h2 id="org916edd9">Key Landmarks &amp; Attractions</h2>
<div class="outline-text-2" id="text-org916edd9">
<ol class="org-ol">
<li>Temples:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Structures (Bastions, Caves, Gates, etc.):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Viewpoints (Ranges / Dams visible):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Not to Miss:
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgd72fa8c" class="outline-2">
<h2 id="orgd72fa8c">Experience &amp; Observations</h2>
<div class="outline-text-2" id="text-orgd72fa8c">
<ol class="org-ol">
<li>Weather / Terrain:</li>
<li>Notable Sights:</li>
<li>Personal Experience:</li>
<li>Vibe / Mood of Place:</li>
<li>Tips for Future Trekkers:</li>
</ol>
</div>
</div>

<div id="outline-container-orga6d5fc7" class="outline-2">
<h2 id="orga6d5fc7">Facilities &amp; Amenities</h2>
<div class="outline-text-2" id="text-orga6d5fc7">
<ol class="org-ol">
<li>Food / Water Availability:</li>
<li>Accommodation / Prasadam Timings:</li>
<li>Shops / Auto Repair / Petrol Info:</li>
<li>Guide Needed:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
</ol>
</div>
</div>

<div id="outline-container-org2ce341b" class="outline-2">
<h2 id="org2ce341b">Local Notes</h2>
<div class="outline-text-2" id="text-org2ce341b">
<ol class="org-ol">
<li>Village Population / Details:</li>
<li>Major FoodCrops:</li>
<li>Local Culture / People:</li>
</ol>
</div>
</div>

<div id="outline-container-orge7d323c" class="outline-2">
<h2 id="orge7d323c">Photos &amp; Media</h2>
<div class="outline-text-2" id="text-orge7d323c">
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Add photos</li>
<li class="off"><code>[&#xa0;]</code> Add route map (GPS screenshot)</li>
<li class="off"><code>[&#xa0;]</code> Add group photo</li>
</ol>
</div>
</div>

<div id="outline-container-org4caa921" class="outline-2">
<h2 id="org4caa921">Reflection</h2>
<div class="outline-text-2" id="text-org4caa921">
<ol class="org-ol">
<li>What I Loved Most:</li>
<li>What I’d Improve Next Time:</li>
<li>Recommend To:</li>
<li>Return Visit:</li>
<li class="off"><code>[&#xa0;]</code> yes/no</li>
<li class="off"><code>[&#xa0;]</code> (why?)</li>

<li>Region: Near Raigad Nagar / RPF firing range belt outside Nashik.</li>
<li>Grade: Easy; intentionally kept as a short family trek.</li>
<li>Route: Short hill path from selected starting point → small top with dam view (Waldevi side) → back the same route.</li>
<li>Trek time: ~1.5–2 hrs total including enjoying the view.</li>
<li>Access: Close to Nashik; sensitive area due to firing range – exact route details are best kept offline and within trusted groups.</li>
<li>Best season: Clear winter mornings for best dam views.</li>
<li>Water/food: Carry a bottle; breakfast plan was at a Jain temple on your group trek.</li>
<li>Safety: Respect firing range boundaries and all instructions; this is not a random wander hill.</li>
<li>Fact: This tekdi is more about safe, small practice climbs and views than about height or difficulty.</li>
<li>Quote: “Some hills are not about adventure; they are about learning how to move in sensitive places with respect.”</li>
</ol>
</div>
</div>
</div>
</body>
</html>